anachrocomputer/PIC32GC/PIC32GameCube.X/GameCube.c
        IFS2CLR = _IFS2_SPI3RXIF_MASK;  // Clear SPI3 Rx interrupt flag
        
        if (SPIDummyReads == 0)
        {
            LATASET = _LATA_LATA0_MASK;

            IEC2CLR = _IEC2_SPI3RXIE_MASK;  // Disable SPI3 Rx interrupt
        }
    }
    else if (IFS2 & _IFS2_SPI3TXIF_MASK)
    {
        SPI3BUF = *SPIBuf++;        // Transmit next byte
        SPINbytes--;
        
        IFS2CLR = _IFS2_SPI3TXIF_MASK;  // Clear SPI3 Tx interrupt flag
        
        if (SPINbytes == 0)
        {
            IEC2CLR = _IEC2_SPI3TXIE_MASK;  // Disable SPI3 Tx interrupt
        }
    }
}

void __ISR(_UART_2_VECTOR, ipl1AUTO) UART2Handler(void)
{
    if (IFS1bits.U2TXIF)
    {
        if (U2Buf.tx.head != U2Buf.tx.tail) // Is there anything to send?
        {
            const uint8_t tmptail = (U2Buf.tx.tail + 1) & UART_TX_BUFFER_MASK;
            
            U2Buf.tx.tail = tmptail;

            U2TXREG = U2Buf.tx.buf[tmptail];     // Transmit one byte
        }
        else
        {
            IEC1CLR = _IEC1_U2TXIE_MASK;         // Nothing left to send; disable Tx interrupt
        }
        
        IFS1CLR = _IFS1_U2TXIF_MASK;  // Clear UART2 Tx interrupt flag
    }
    
    if (IFS1bits.U2RXIF)
    {
        const uint8_t tmphead = (U2Buf.rx.head + 1) & UART_RX_BUFFER_MASK;
        const uint8_t ch = U2RXREG;   // Read received byte from UART
        
        if (tmphead == U2Buf.rx.tail)   // Is receive buffer full?
        {
             // Buffer is full; discard new byte
        }
        else
        {
            U2Buf.rx.head = tmphead;
            U2Buf.rx.buf[tmphead] = ch;   // Store byte in buffer
        }
        
        IFS1CLR = _IFS1_U2RXIF_MASK;  // Clear UART2 Rx interrupt flag
    }
    
    if (IFS1bits.U2EIF)
    {
        IFS1CLR = _IFS1_U2EIF_MASK;   // Clear UART2 error interrupt flag
    }
}


static void UART1_begin(const int baud)
{
    /* Configure PPS pins */
    RPE5Rbits.RPE5R = 3;    // U1Tx on pin 3, RPE5
    U1RXRbits.U1RXR = 10;   // U1Rx on pin 6, RPC1
    
    /* Configure USART1 */
    U1MODEbits.UEN = 3;     // Use just Rx/Tx; no handshaking
    
    U1STAbits.UTXEN = 1;    // Enable Tx
    U1STAbits.URXEN = 1;    // Enable Rx (unused at present)
    
    U1BRG = (40000000 / (baud * 16)) - 1;
    
    U1MODESET = _U1MODE_ON_MASK;      // Enable USART1
}

static void UART2_begin(const int baud)
{
    U2Buf.tx.head = 0;
    U2Buf.tx.tail = 0;
    U2Buf.rx.head = 0;
    U2Buf.rx.tail = 0;
    
    /* Configure PPS pins */
    RPG0Rbits.RPG0R = 1;    // U2Tx on pin 90, RPG0
    
    /* Configure USART2 */
    U2MODEbits.UEN = 3;     // Use just Rx/Tx; no handshaking
    
    U2STAbits.UTXEN = 1;    // Enable Tx
    U2STAbits.URXEN = 1;    // Enable Rx (unused at present)
    
    U2BRG = (40000000 / (baud * 16)) - 1;
    
    IPC9bits.U2IP = 1;          // UART2 interrupt priority 1
    IPC9bits.U2IS = 2;          // UART2 interrupt sub-priority 2
    
    IFS1CLR = _IFS1_U2TXIF_MASK;  // Clear UART2 Tx interrupt flag
    IFS1CLR = _IFS1_U2RXIF_MASK;  // Clear UART2 Rx interrupt flag
    IFS1CLR = _IFS1_U2EIF_MASK;   // Clear UART2 error interrupt flag
    
    IEC1SET = _IEC1_U2RXIE_MASK;  // Enable UART2 Rx interrupt
    IEC1SET = _IEC1_U2EIE_MASK;   // Enable UART2 error interrupt
    
    U2MODESET = _U2MODE_ON_MASK;      // Enable USART2
}

uint8_t UART2RxByte(void)
{
    const uint8_t tmptail = (U2Buf.rx.tail + 1) & UART_RX_BUFFER_MASK;
    
    while (U2Buf.rx.head == U2Buf.rx.tail)  // Wait, if buffer is empty
        ;
    
    U2Buf.rx.tail = tmptail;
    
    return (U2Buf.rx.buf[tmptail]);
}


void UART2TxByte(const uint8_t data)
{
    const uint8_t tmphead = (U2Buf.tx.head + 1) & UART_TX_BUFFER_MASK;
    
    while (tmphead == U2Buf.tx.tail)   // Wait, if buffer is full
        ;

    U2Buf.tx.buf[tmphead] = data;
    U2Buf.tx.head = tmphead;

    IEC1SET = _IEC1_U2TXIE_MASK;       // Enable UART2 Tx interrupt
}


bool UART2RxAvailable(void)
{
    return (U2Buf.rx.head != U2Buf.rx.tail);
}


static void UART3_begin(const int baud)
{
    /* Configure PPS pins */
    RPF1Rbits.RPF1R = 1;    // U3Tx on pin 88, RPF1
    
    /* Configure USART3 */
    U3MODEbits.UEN = 3;     // Use just Rx/Tx; no handshaking
    
    U3STAbits.UTXEN = 1;    // Enable Tx
    U3STAbits.URXEN = 1;    // Enable Rx (unused at present)
    
    U3BRG = (40000000 / (baud * 16)) - 1;
    
    U3MODESET = _U3MODE_ON_MASK;      // Enable USART3
}

static void UART4_begin(const int baud)
{
    /* Configure PPS pins */
    RPD4Rbits.RPD4R = 2;    // U4Tx on pin 81, RPD4
    
    /* Configure USART4 */
    U4MODEbits.UEN = 3;     // Use just Rx/Tx; no handshaking
    
    U4STAbits.UTXEN = 1;    // Enable Tx
    U4STAbits.URXEN = 1;    // Enable Rx (unused at present)
    
    U4BRG = (40000000 / (baud * 16)) - 1;
    
    U4MODESET = _U4MODE_ON_MASK;      // Enable USART4
}

static void UART5_begin(const int baud)
{
    /* Configure PPS pins */
    RPD12Rbits.RPD12R = 4;  // U5Tx on pin 79, RPD12
    
    /* Configure USART5 */
    U5MODEbits.UEN = 3;     // Use just Rx/Tx; no handshaking
    
    U5STAbits.UTXEN = 1;    // Enable Tx
    U5STAbits.URXEN = 1;    // Enable Rx (unused at present)
    
    U5BRG = (40000000 / (baud * 16)) - 1;
    
    U5MODESET = _U5MODE_ON_MASK;      // Enable USART5
}

void _mon_putc(const char ch)
{
    // See: https://microchipdeveloper.com/faq:81
    if (ch == '\n')
    {
        UART2TxByte('\r');
    }

    UART2TxByte(ch); // Connect stdout to UART2
}


static void ADC_begin(void)
{    
    AD1CON1bits.FORM = 0; // Integer
    AD1CON1bits.SSRC = 7; // Auto convert after sampling
    AD1CON1bits.ASAM = 0; // Sampling begins when SAMP bit is set
    AD1CON1bits.SAMP = 0;
    
    AD1CON2bits.VCFG = 0;  // Vdd/Vss references
    AD1CON2bits.CSCNA = 0; // Do not scan inputs
    AD1CON2bits.ALTS = 0;  // Always use MUX A
    AD1CON2bits.SMPI = 0;  // Interrupt on every conversion
    
    AD1CON3bits.ADRC = 0;   // Peripheral bus clock
    AD1CON3bits.SAMC = 15;  // Auto-sample 15 Tad
    AD1CON3bits.ADCS = 127; // Slow clock
    
    AD1CHSbits.CH0SA = 6; // Mux to AN6
    AD1CHSbits.CH0NA = 0; // Negative input is Vr-    
    
