anachrocomputer/PIC32GC/PIC32GameCube.X/GameCube.c
static void PPS_begin(void)
{
    /* Configure USART1 */
    RPE5Rbits.RPE5R = 3;    // U1Tx on pin 3, RPE5
    U1RXRbits.U1RXR = 10;   // U1Rx on pin 6, RPC1
    
    /* Configure USART2 */
    RPG0Rbits.RPG0R = 1;    // U2Tx on pin 90, RPG0
    U2RXRbits.U2RXR = 12;   // U2Rx on pin 89, RPG1 (5V tolerant)
    
    /* Configure USART3 */
    RPF1Rbits.RPF1R = 1;    // U3Tx on pin 88, RPF1
    U3RXRbits.U3RXR = 4;    // U3Rx on pin 87, RPF0
    
    /* Configure USART4 */
    RPD4Rbits.RPD4R = 2;    // U4Tx on pin 81, RPD4
    U4RXRbits.U4RXR = 6;    // U4Rx on pin 82, RPD5 (5V tolerant)
    
    /* Configure USART5 */
    RPD12Rbits.RPD12R = 4;  // U5Tx on pin 79, RPD12
    U5RXRbits.U5RXR = 0;    // U5Rx on pin 76, RPD1
    
    /* Configure OC pins (PWM) */
    RPD8Rbits.RPD8R = 12; // OC1 on pin 68, P7 pin 10 (LED PWM)
    RPD0Rbits.RPD0R = 11; // OC2 on pin 72, P7 pin 14 (tone)
    
    /* Configure SPI1 */
    // SCK1 on pin 70 RD10 - can't use on this PCB
    //SDI1Rbits.SDI1R = 0;   // SDI1 on RPD3
    //RPC13Rbits.RPC13R = 8; // SDO1 on RPC13
    
    /* Configure SPI2 */
    // SCK2 on pin 10, RG6, P1 pin 32
    SDI2Rbits.SDI2R = 0;   // SDI2 on RPD3, pin 78
    RPC13Rbits.RPC13R = 6; // SDO2 on RPC13, pin 73, P7 pin 16
    
    /* Configure SPI3 */
    // SCK3 on pin 39, RF13, P1 pin 15
    SDI3Rbits.SDI3R = 0;   // SDI3 on RPD2, pin 77
    RPG8Rbits.RPG8R = 14;  // SDO3 on RPG8, pin 12, P1 pin 28
    
    /* Configure SPI4 */
    // SCK4 on pin 48, RD15 blocked by Main current sense
    
    /* Configure I2C1 */
    // SCL1 on RA14, pin 66, P1 pin 19
    // SDA1 on RA15, pin 67, P1 pin 21
    
    /* Configure I2C2 */
    // SCL2 on RA2, pin 58, P7 pin 20
    // SDA2 on RA3, pin 59, P7 pin 22
}


/* TRIS_begin --- switch GPIO pins to input or output as required */

static void TRIS_begin(void)
{
    TRISEbits.TRISE6 = 0;   // LED1 pin 4 as output
    TRISEbits.TRISE7 = 0;   // LED2 pin 5 as output
    TRISEbits.TRISE1 = 0;   // LED3 pin 94 as output
    TRISAbits.TRISA7 = 0;   // LED4 pin 92 as output
    TRISAbits.TRISA6 = 0;   // LED5 pin 91 as output
    
    TRISGbits.TRISG15 = 0;  // U1EN pin 1 as output
    TRISEbits.TRISE2 = 0;   // U2EN pin 98 as output
    TRISGbits.TRISG12 = 0;  // U3EN pin 96 as output
    TRISDbits.TRISD13 = 0;  // U4EN pin 80 as output
    TRISDbits.TRISD11 = 0;  // U5EN pin 71 as output
    
    TRISEbits.TRISE3 = 1;   // U1FAULT pin 99 as input
    TRISGbits.TRISG13 = 1;  // U2FAULT pin 97 as input
    TRISGbits.TRISG14 = 1;  // U3FAULT pin 95 as input
    TRISDbits.TRISD3 = 1;   // U4FAULT pin 78 as input
    TRISDbits.TRISD10 = 1;  // U5FAULT pin 70 as input
    TRISFbits.TRISF5 = 1;   // Main current FAULT pin 50 as input
    TRISFbits.TRISF4 = 1;   // Motor current FAULT pin 49 as input
    
    ANSELEbits.ANSE4 = 1;   // U1 current sense pin 100, RE4, AN21, analog
    ANSELEbits.ANSE0 = 1;   // U2 current sense pin 93, RE0, AN46, analog
    ANSELDbits.ANSD7 = 1;   // U3 current sense pin 84, RD7, AN43, analog
    ANSELDbits.ANSD6 = 1;   // U4 current sense pin 83, RD6, AN42, analog
    ANSELDbits.ANSD2 = 1;   // U5 current sense pin 77, RD2, AN25, analog
    ANSELDbits.ANSD14 = 1;  // Main current sense pin 47, RD14, AN36, analog
    ANSELDbits.ANSD15 = 1;  // Motor current sense pin 48, RD15, AN37, analog (blocks SCK4)

    TRISEbits.TRISE4 = 1;   // U1 current sense pin 100, RE4, AN21, input
    TRISEbits.TRISE0 = 1;   // U2 current sense pin 93, RE0, AN46, input
    TRISDbits.TRISD7 = 1;   // U3 current sense pin 84, RD7, AN43, input
    TRISDbits.TRISD6 = 1;   // U4 current sense pin 83, RD6, AN42, input
    TRISDbits.TRISD2 = 1;   // U5 current sense pin 77, RD2, AN25, input
    TRISDbits.TRISD14 = 1;  // Main current sense pin 47, RD14, AN36, input
    TRISDbits.TRISD15 = 1;  // Motor current sense pin 48, RD15, AN37, input (blocks SCK4)
    
    TRISBbits.TRISB15 = 0;  // HV_EN pin 44 as output
    
    // TODO: Add head LEDs and Add-On ports on daughter board
    
    ANSELBbits.ANSB6 = 1;   // Pot on pin 26, P1-37, RB6, AN6 analog
    TRISBbits.TRISB6 = 1;   // Pot on pin 26, P1-37, RB6, AN6 input
    
    TRISAbits.TRISA4 = 0;   // RA4 pin 60, P7 pin 6 as output (command pin)
    TRISAbits.TRISA5 = 1;   // RA5 pin 61, P7 pin 8 as input (reply pin)
    TRISDbits.TRISD0 = 0;   // RD0 pin 72, P7 pin 14 as output (SYNC signal)
}


int ReadController(const uint8_t cmd, const int nBits, uint8_t buf[])
{
    int i;
    uint32_t mask;
    const int expectedBits = nBits + 1;
    int actualBits = 0;
    int oneTime, zeroTime;
    int w, h, l;
    uint8_t pulseh[66];
    uint8_t pulsel[66];
    
    __asm__("DI");              // Global interrupt disable
        
    mask = 0x80;

    for (i = 0; i < 8; i++)
    {
        if (cmd & mask)
        {
            LATACLR = _LATA_LATA4_MASK;  // 1us LOW

            dally(2);
            __asm__("NOP");
            __asm__("NOP");
            __asm__("NOP");
            __asm__("NOP");

            LATASET = _LATA_LATA4_MASK;  // 3us HIGH

            dally(8);
        }
        else
        {
            LATACLR = _LATA_LATA4_MASK;  // 3us LOW

            dally(9);

            LATASET = _LATA_LATA4_MASK;  // 1us HIGH

            dally(1);
            __asm__("NOP");
            __asm__("NOP");
            __asm__("NOP");
            __asm__("NOP");
            __asm__("NOP");
            __asm__("NOP");
        }

        mask >>= 1;
    }

    // Send stop bit, 1us LOW
    __asm__("NOP");
    __asm__("NOP");
    __asm__("NOP");
    __asm__("NOP");
    LATACLR = _LATA_LATA4_MASK;  // 1us LOW

    dally(2);

    LATASET = _LATA_LATA4_MASK;

    dally(1);
            
    for (w = 0; w < 256; w++)       // Wait for controller to pull line LOW
    {
        if (PORTAbits.RA5 == 0)
            break;
    }

    for (i = 0; i < expectedBits; i++)
    {
        for (l = 0; l < 64; l++)
            if (PORTAbits.RA5 != 0)
                break;

        for (h = 0; h < 64; h++)
            if (PORTAbits.RA5 == 0)
                break;

        pulseh[i] = h;
        pulsel[i] = l;
    }

    __asm__("EI");              // Global interrupt enable

    memset(buf, 0, nBits / 8);

    oneTime = (pulsel[1] + pulseh[1]) / 3;
    zeroTime = oneTime * 2;
    
    if (w < 255)
    {
        for (i = 0; i < expectedBits; i++)
        {
            int bitVal;

            if (pulsel[i] > zeroTime)
            {
                bitVal = 0;
            }
            else if (pulsel[i] < oneTime)
            {
                bitVal = 1;
                buf[i / 8] |= 0x80 >> (i % 8);
            }
            else
            {
                bitVal = 2;
                actualBits = i;
            }

            //printf("%d: %2d %2d %2d %d\n", i, pulsel[i] + pulseh[i], pulsel[i], pulseh[i], bitVal);
        }

        //printf("cmd = %d, w = %d\n", cmd, w);
        
        return (actualBits);
    }
    else
    {
        //printf("cmd = %d, w = %d: No response from controller\n", cmd, w);
        
        return (0);
    }
}


void main(void)
{
    ControllerReply buf;
    
