anachrocomputer/PIC32GC/PIC32GameCube.X/GameCube.c
    /* Set up peripherals to match pin connections on PCB */
    PPS_begin();
    
    /* Configure tri-state registers */
    TRIS_begin();
    
    LATBbits.LATB15 = 0;  // HV_EN pin 44 LOW (6V regulator OFF)
    
    /* Switch off the MOSFETs */
    LATGbits.LATG15 = 0;  // U1EN pin 1 OFF
    LATEbits.LATE2 = 0;   // U2EN pin 98 OFF
    LATGbits.LATG12 = 0;  // U3EN pin 96 OFF
    LATDbits.LATD13 = 0;  // U4EN pin 80 OFF
    LATDbits.LATD11 = 0;  // U5EN pin 71 OFF
    
    UART1_begin(9600);
    UART2_begin(9600);
    UART3_begin(9600);
    UART4_begin(9600);
    UART5_begin(9600);

    ADC_begin();
    
    I2C1_begin(100);
    
    SPI3_begin(1000000);
    
    RPD8Rbits.RPD8R = 12; // OC1 on P7 pin 10 (LED PWM)
    
    /* Configure Timer 3 for 10-bit PWM */
    T3CONbits.TCKPS = 6;        // Timer 3 prescale: 64
    
    TMR3 = 0x00;                // Clear Timer 3 counter
    PR3 = 1023;                 // PWM range 0..1023 (10 bits)
    
    T3CONbits.ON = 1;           // Enable Timer 3
    
    OC1CONbits.OCTSEL = 1;      // Source: Timer 3
    OC1CONbits.OCM = 6;         // PWM mode
    
    OC1RS = 256;
    
    OC1CONbits.ON = 1;          // Enable OC1 PWM
            
    /* Configure Timer 1 */
    T1CONbits.TCKPS = 0;        // Timer 1 prescale: 1
    
    TMR1 = 0x00;                // Clear Timer 1 counter
    PR1 = 39999;                // Interrupt every 40000 ticks (1ms)
    
    T1CONbits.ON = 1;           // Enable Timer 1
    
    /* Configure interrupts */
    INTCONSET = _INTCON_MVEC_MASK; // Multi-vector mode
    
    IPC1bits.T1IP = 2;          // Timer 1 interrupt priority 2
    IPC1bits.T1IS = 1;          // Timer 1 interrupt sub-priority 1
    IFS0CLR = _IFS0_T1IF_MASK;  // Clear Timer 1 interrupt flag
    IEC0SET = _IEC0_T1IE_MASK;  // Enable Timer 1 interrupt
    
    IPC4bits.T4IP = 4;          // Timer 4 interrupt priority 4
    IPC4bits.T4IS = 1;          // Timer 4 interrupt sub-priority 1
    IFS0CLR = _IFS0_T4IF_MASK;  // Clear Timer 4 interrupt flag
    IEC0SET = _IEC0_T4IE_MASK;  // Enable Timer 4 interrupt
    
    __asm__("EI");              // Global interrupt enable
    
    OLED_begin(MAXX, MAXY);
    
    greyFrame();
    
    updscreen();

    delayms(50);
    
    puts("GameCube");
    
    LATASET = _LATA_LATA4_MASK; // Set RA4 HIGH initially
    
    while (1)
    {
        memcpy(Frame, DdsLogo, sizeof (Frame));
        
        if (ReadController(0x01, 32, buf.asBytes) > 0)
        {
            char butStr[17];
            
            butStr[0]  = buf.asN64.butA      ? 'A' : '.';
            butStr[1]  = buf.asN64.butB      ? 'B' : '.';
            butStr[2]  = buf.asN64.butZ      ? 'Z' : '.';
            butStr[3]  = buf.asN64.butL      ? 'L' : '.';
            butStr[4]  = buf.asN64.butR      ? 'R' : '.';
            butStr[5]  = buf.asN64.butStart  ? 'S' : '.';
            butStr[6]  = buf.asN64.dpadLeft  ? 'L' : '.';
            butStr[7]  = buf.asN64.dpadRight ? 'R' : '.';
            butStr[8]  = buf.asN64.dpadUp    ? 'U' : '.';
            butStr[9]  = buf.asN64.dpadDown  ? 'D' : '.';
            butStr[10] = buf.asN64.cpadLeft  ? 'L' : '.';
            butStr[11] = buf.asN64.cpadRight ? 'R' : '.';
            butStr[12] = buf.asN64.cpadUp    ? 'U' : '.';
            butStr[13] = buf.asN64.cpadDown  ? 'D' : '.';
            butStr[14] = '\0';
            
            LED1 = buf.asN64.butA ? 0 : 1;
            LED2 = buf.asN64.butB ? 0 : 1;
            LED3 = buf.asN64.butZ ? 0 : 1;
            LED4 = buf.asN64.butL ? 0 : 1;
            LED5 = buf.asN64.butR ? 0 : 1;
            
            printf("%s %d %d\n", butStr, buf.asN64.joyx, buf.asN64.joyy);
        }
        else
        {
            LED1 = 1;
            LED2 = 1;
            LED3 = 1;
            LED4 = 1;
            LED5 = 1;
            
            printf("No reply\n");
        }
        
        updscreen();
        
        delayms(50);
    }
}

